experiments/results/logs/burst-hpa-008/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6820.778ms, rate sampling interval: 17661ms
  Thread calibration: mean lat.: 7032.504ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 6663.618ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 6351.872ms, rate sampling interval: 16211ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    27.69s    1.72m    56.31%
    Req/Sec     3.12      0.33     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96m 
 75.000%    1.35m 
 90.000%    1.59m 
 99.000%    1.69m 
 99.900%    1.71m 
 99.990%    1.72m 
 99.999%    1.72m 
100.000%    1.72m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9437.183     0.000000            1         1.00
   18251.775     0.100000          168         1.11
   27361.279     0.200000          335         1.25
   36929.535     0.300000          503         1.43
   46366.719     0.400000          670         1.67
   57442.303     0.500000          840         2.00
   61243.391     0.550000          921         2.22
   66224.127     0.600000         1004         2.50
   71041.023     0.650000         1089         2.86
   75300.863     0.700000         1175         3.33
   80805.887     0.750000         1256         4.00
   82509.823     0.775000         1297         4.44
   86835.199     0.800000         1343         5.00
   88080.383     0.825000         1383         5.71
   90898.431     0.850000         1424         6.67
   92667.903     0.875000         1465         8.00
   93257.727     0.887500         1485         8.89
   95223.807     0.900000         1506        10.00
   96403.455     0.912500         1531        11.43
   97517.567     0.925000         1548        13.33
   98566.143     0.937500         1571        16.00
   98828.287     0.943750         1581        17.78
   99418.111     0.950000         1592        20.00
   99745.791     0.956250         1601        22.86
  100073.471     0.962500         1611        26.67
  100270.079     0.968750         1625        32.00
  100335.615     0.971875         1633        35.56
  100335.615     0.975000         1633        40.00
  100597.759     0.978125         1637        45.71
  101056.511     0.981250         1644        53.33
  101253.119     0.984375         1652        64.00
  101253.119     0.985938         1652        71.11
  101318.655     0.987500         1655        80.00
  101318.655     0.989062         1655        91.43
  101384.191     0.990625         1660       106.67
  101384.191     0.992188         1660       128.00
  101449.727     0.992969         1663       142.22
  101449.727     0.993750         1663       160.00
  101515.263     0.994531         1664       182.86
  102301.695     0.995313         1666       213.33
  102367.231     0.996094         1668       256.00
  102367.231     0.996484         1668       284.44
  102367.231     0.996875         1668       320.00
  102432.767     0.997266         1669       365.71
  102563.839     0.997656         1671       426.67
  102563.839     0.998047         1671       512.00
  102563.839     0.998242         1671       568.89
  102563.839     0.998437         1671       640.00
  102563.839     0.998633         1671       731.43
  102629.375     0.998828         1672       853.33
  102629.375     0.999023         1672      1024.00
  102629.375     0.999121         1672      1137.78
  102629.375     0.999219         1672      1280.00
  102629.375     0.999316         1672      1462.86
  103350.271     0.999414         1673      1706.67
  103350.271     1.000000         1673          inf
#[Mean    =    56426.457, StdDeviation   =    27686.251]
#[Max     =   103284.736, Total count    =         1673]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1771 requests in 2.00m, 18.16MB read
  Socket errors: connect 0, read 0, write 0, timeout 4229
Requests/sec:     14.74
Transfer/sec:    154.76KB